<?php
require_once("monster.php");


$monsterList = array(//番号、名前、タイプ、タイプ2、タイプの色、タイプの色2、攻撃、特攻、防御、特防、すばやさ、HP、画像、わざ一覧の順番

$monster0 = new Monster(0,"フシギバナ","草","毒","reaf","poison",133,151,134,151,131,186,"img/0.png",array("ハードプラント","ねむりごな","はっぱカッター","のしかかり")),
$monster1 = new Monster(1,"リザードン","火","飛","fire","fly",135,160,129,136,151,184,"img/1.png",array("ブラストバーン","エアスラッシュ","フレアドライブ","りゅうのはどう")),
$monster2 = new Monster(2,"カメックス","水","","water","",134,136,151,156,129,185,"img/2.png",array("ハイドロカノン","なみのり","ふぶき","地震")),
$monster3 = new Monster(3,"ピジョット","普","飛","normal","fly",131,121,126,121,142,189,"img/3.png",array("はねやすめ","つばさでうつ","ブレイブバード","すてみタックル")),
$monster4 = new Monster(4,"ニドキング","毒","地","poison","earth",143,136,128,126,136,187,"img/4.png",array("地震","どくづき","ストーンエッジ","10万ボルト")),
$monster5 = new Monster(5,"ダクトリオ","地","","earth","",131,101,101,121,171,141,"img/5.png",array("地震","きりさく","いわなだれ","じわれ")),
$monster6 = new Monster(6,"ウインディ","火","","fire","",161,151,131,131,146,196,"img/6.png",array("フレアドライブ","ワイルドボルト","しんそく","かえんほうしゃ")),
$monster7 = new Monster(7,"フーディン","念","","esper","",101,186,96,136,171,161,"img/7.png",array("サイコキネシス","めいそう","じこさいせい","きあいだま")),
$monster8 = new Monster(8,"カイリキー","闘","","fight","",181,116,131,136,106,196,"img/8.png",array("ばくれつパンチ","地震","ストーンエッジ","ビルドアップ")),
$monster9 = new Monster(9,"ゴローニャ",'地',"岩",'earth',"rock",161,106,181,116,96,186,"img/9.png",array("地震","ストーンエッジ","いわなだれ","ロックカット")),
$monster10 = new Monster(10,"ベトベトン","毒","","poison","",156,116,126,151,101,211,"img/10.png",array("ダストシュート","とける","10万ボルト","だいもんじ")),
$monster11 = new Monster(11,"ゲンガー","毒","霊","poison","goast",116,181,111,126,161,166,"img/11.png",array("さいみんじゅつ","あやしいひかり","シャドーボール","サイコキネシス")),
$monster12 = new Monster(12,"ナッシー","草",'念',"reaf","esper",146,176,136,116,106,201,"img/12.png",array("リーフストーム","サイコキネシス","たまごばくだん","さいみんじゅつ")),
$monster13 = new Monster(13,"スターミー","水","念","water","esper",126,151,136,136,166,166,"img/13.png",array("サイコキネシス","れいとうビーム","じこさいせい","ハイドロポンプ")),
$monster14 = new Monster(14,"ストライク","飛","虫","fly","insect",161,106,131,131,156,176,"img/14.png",array("つるぎのまい","きりさく","シザークロス","かわらわり")),
$monster15 = new Monster(15,"ケンタロス","普","","normal","",151,91,146,121,161,181,"img/15.png",array("ギガインパクト","地震","しねんのずつき","のしかかり")),
$monster16 = new Monster(16,"ギャラドス","水","飛","water","fly",176,111,130,151,132,201,"img/16.png",array("ギガインパクト","こおりのきば","りゅうのまい","たきのぼり")),
$monster17 = new Monster(17,"ラプラス","水","氷","water","ice",136,136,131,146,111,236,"img/17.png",array("ふぶき","れいとうビーム","サイコキネシス","なみのり")),
$monster18 = new Monster(18,"シャワーズ","水","","water","",116,161,111,146,116,236,"img/18.png",array("ハイドロポンプ","とける","ねっとう","れいとうビーム")),
$monster19 = new Monster(19,"サンダーズ","電","","spark","",116,161,111,146,181,171,"img/19.png",array("シャドーボール","かみなり","でんじは","でんこうせっか")),
$monster20 = new Monster(20,"ブースター","火","","fire","",181,146,111,161,116,171,"img/20.png",array("フレアドライブ","おにび","かえんほうしゃ","すてみタックル")),
$monster21 = new Monster(21,"プテラ","飛","岩","fly","rock",156,111,116,126,181,186,"img/21.png",array("ストーンエッジ","ブレイブバード","かみつく","はかいこうせん")),
$monster22 = new Monster(22,"カビゴン","普","","normal","",161,116,116,161,81,266,"img/22.png",array("ギガインパクト","地震","のしかかり","サイコキネシス")),
$monster23 = new Monster(23,"カイリュー","飛","竜","fly","doragon",185,151,146,151,131,197,"img/23.png",array("げきりん","りゅうのまい","しんそく","じしん")),
$monster24 = new Monster(24,"ミュウツー","念","","esper","",161,205,141,141,181,212,"img/24.png",array("サイコブレイク","はどうだん","10万ボルト","じこさいせい"))




);

 ?>
